#  Pythonの学習
#  プログラムを用いて情報数学基礎の単位を取得

#  [1] 直接入力方式
print("3 + 10")
print(3 + 10)

#  [2] 各種演算（四則演算など）
#  加
print("123 + 111")
print(123 + 111)

#  減
print("123 - 333")
print(123 - 333)
print("123 - -123")
print(123 - -123)

#  乗
print("123456789 * 9")
print(123456789 * 9)

#  余(通常時)
print("457 / 3")
print(457 / 3)

#  余(商を求める演算)
print("457 // 3")
print(457 // 3)

#  余(余りを求める演算)
print("-8 % 7")
print(-8 % 7)
print("457 % 3")
print(457 % 3)

#  余(検算)
print("3 * 457 + 1")
print(3 * 457 + 1)

#  商と余りを同時に求める
print("divmod(-8,7)")
print(divmod(-8, 7))

#  べき乗
print("2 ** 4")
print(2 ** 4)

#  "\"は改行を示す特殊記号

print("a = 1 + 2 + 3 + 4 + 5 \
    + 6 + 7 + 8 + 9 + 10")
a = 1 + 2 + 3 + 4 + 5 \
    + 6 + 7 + 8 + 9 + 10
print(a)
